
def area(a):
    '''
        Вычисляет площадь квадрата.

        Параметры:
        a (float): Длина стороны квадрата.

        Возвращаемое значение:
        float: Площадь квадрата, которая равна a * a.

        Пример:
        >>> area(4)
        16
    '''
    return a * a


def perimeter(a):
    '''
        Вычисляет периметр квадрата.

        Параметры:
        a (float): Длина стороны квадрата.

        Возвращаемое значение:
        float: Периметр квадрата, который равен 4 * a.

        Пример:
        >>> perimeter(4)
        16
    '''
    return 4 * a
